Repository: SBuild-org/sbuild
Catalog: org.sbuild.runner/src/main/po/SBuildMessages_*.po
Languages: de

source: File is not present and can not be downloaded in offline-mode: {0}
de: Datei existiert nicht und kann im Offline-Modus nicht heruntergeladen werden: {0}

source: File "{0}" already exists.
de: Datei "{0}" existiert nicht.

source: Checking target:
de: Überprüfe target:

source: FAILED:
de: FEHLER:

source: Project {0} contains {1} cacheable target, but does not declare any target with "evictCache".
de: Project {0} enthält {1} cacheable Targets, aber deklariert kein Target mit "evictCache".

source: Project:
de: Projekt:

source: Reflective invokation message:
de: Meldung eines reflektiven Aufrufs:

source: No global settings file found: {0}
de: Keine globale Settings-Datei gefunden: {0}

source: About to read global settings file: {0}
de: Lese globale Settings-Date: {0}

source: Could not read settings file "{0}"
de: Konnte Settings-Datei "{0}" nicht lesen

source: Could not read setting "{0}" from settings file "{1}".
de: Konnte Setting "{0}" von Settings-Datei "{1}" nicht lesen.

source: Deleting {0}
de: Lösche {0}

source: SBuild commandline was invalid. Please use --help for supported commandline options.
de: SBuild Kommandozeile war ungültig. Bitte verwenden sie --help für eine Liste unterstützter Optionen.

source: SBuild detected a invalid usage of SBuild API. Please consult the API Refence Documentation at http://sbuild.org/doc/sbuild .
de: SBuild hat eine ungültige Verwendung der SBuild API erkannt. Konsultieren sie die API Reference Dokumentation unter http://sbuild.org/doc/sbuild .

source: SBuild detected a failure in the project configuration or the build scripts.
de: SBuild hat einen Fehler in der Projektkonfiguration oder im Build-Skript festgestellt.

source: SBuild failed because an invalid target was requested. For a list of available targets use --list-targets or --list-targets-recursive. Use --help for a list of other commandline options.
de: SBuild schlug fehl da ein unbekanntes Target angeforder wurde. Für eine Liste von verfügbaren Targets verwende --list-targets oder --list-targets-recursive. Verwende --help für eine Liste aller Kommandozeilenoptionen.

source: SBuild detected a failure in a target execution.
de: SBuild hat einen Fehler während der Ausführung eines Targets erkannt.

source: SBuild failed with an unexpected exception ({0}).
de: SBuild ist mit einer unbekannten Exception ({0}) fehlgeschlagen.

source: Initializing project...
de: Initialisiere Projekt...

source: Found the following {0} problems:
de: Folgende {0} Probleme wurden gefunden:

source: Dependency tree:
de: Abhängigkeitsbaum...

source: Execution plan (not optimized):
de: Ausführungsplan (nicht optimiert):

source: Enabled parallel processing. Explicit parallel threads (None = nr of cpu cores): {0}
de: Aktiviere parallele Ausführung. Explizit parallele threads (None = Anzahl der CPU-Kerne): {0}

source: Executing...
de: Führe aus...

source: Requested targets:
de: Angeforderte Targets:

source: Execution finished. SBuild init time: {0} msec, Execution time: {1} msec
de: Ausführung beendet. SBuild Init-Zeit: {0} msec, Ausführungszeit: {1} msec

source: Execution failed. SBuild init time: {0} msec, Execution time: {1} msec
de: Ausführung fehlgeschlagen. SBuild Init-Zeit: {0} msec, Ausführungszeit: {1} msec

source: Some targets failed or were skipped because of unsatisfied dependencies: {0}{1}
de: Einige Targets schlugen fehl oder wurden wegen unerfüllter Abhängigkeiten ausgelassen: {0}

source: The buildscript "{0}" requires at least SBuild version: {1}
de: Für Buildfile "{0}" wird mindests SBuild in Version {1} vorausgesetzt.

source: The plugin(s) "{0}" in project "{1}" requires at least SBuild version: {2}
de: Plugin(s) "{0}" in Projekt "{1}" setzen mindestens SBuild in Version {2} voraus.

source: The plugin "{0}" in buildscript "{1}" requires at least SBuild version: {2}
de: Das Plugin "{0}" in Buildscript "{1}" setzt mindestens SBuild in Version {2} voraus.

source: Project buildfile does not exists or is not a file: {0}
de: Projekt Buildfile existiert nicht oder ist keine gültige Datei: {0}

source: A bootstrap resource does not exists or is not a file: {0}
de: Eine Bootstrap-Ressources existiert nicht oder ist keine gültige Datei: {0}

source: It was requested by: {0}
de: Angefordert von: {0}

source: Modification time of file "{0}" is in the future. Up-to-date checks may be incorrect.
de: Veränderungszeit der Datei "{0}" liegt in der Zukunft. Aktualitätsprüfungen könnten nicht korrekt ausfallen.

source: Target "{0}" has no defined execution. Don't know how to create or update file "{1}".
de: Für Target "{0}" wurde kein Exec-Block definiert. Kann Target nicht erzeugen oder aktualisieren.

source: Executing target:
de: Verarbeite Target:

source: Outcome of target {0} looks out-of-date, as the timestamp hasn't changed.
de: Ergebnis von Target {0} scheint nicht aktuell zu sein, da der Zeitstempel sich nicht geändert hat.

source: Execution of target {0} failed with an exception: {1}. {2}
de: Ausführung von Target {0} schlug mit einer Exception fehl: {1}. {2}

source: Execution of target "{0}" aborted after {1} msec with errors: {2}
de: Ausführung von Target "{0}" nach {1} msek mit Fehlern abgebrochen: {2}

source: Finished target:
de: Target fertiggestellt:

source: after {0} msec
de: nach {0} msek

source: Failed target:
de: Target fehlgeschlagen:

source: Skipped unsatisfied target:
de: Überpringe unerfülltes Target:

source: Skipped previously failed target:
de: Überspringe früher fehlgschlagenes Target:

source: Skipped target:
de: Überspringe Target:

source: Skipped empty target:
de: Überpringe leeres Target:

source: Skipped cached target:
de: Überspringe zwischengespeichertes Target:

source: Reported modification time of target "{0}" is in the future. Up-to-date checks may be incorrect.
de: Berichtete Veränderungszeit von Target "{0}" liegt in der Zukunft. Aktualitätsprüfungen könnten nicht korrekt ausfallen.

source: Project directory "{0}" does not exists.
de: Projektverzeichnis "{0}" existiert nicht.

source: Project directory "{0}" is not a directory.
de: Projektverzeichnis "{0}" is kein Verzeichnis.

source: Replacing scheme handler "{0}" for project "{1}".
de: Ersetze SchemeHandler "{0}" für Projekt "{1}".

source: Cannot replace scheme handler "{0}" for project "{1}". No previous scheme handler registered under this name.
de: Kann SchemeHandler "{0}" für Projekt "{1}" nicht ersetzen. Keine vorheriger SchemeHandler unter diesem Namen registriert.

source: Ignoring redefinition of property: {0}
de: Ignoriere Neudefinition von Property: {0}

source: Could not determine the location of the (included/bootstrap) file which contains class "{0}".
de: Konnte den Ort der Eingebundenen/Bootstrap Datei, die die Klasse "{0}" enthält, nicht ermitteln.

source: Reassignment of exec block for target {0} in project file {1}
de: Neuzuweisung eines exec-Bocks für Target {0} in Projectdatei {1}
